ice458/RPN_Scientific_Calc/src/packs/PIC32CM2532LE00048_DFP/component/sercom.h
#define SERCOM_USART_EXT_FIFOPTR_CPUWRPTR_Pos _UINT16_(0)                                          /* (SERCOM_USART_EXT_FIFOPTR) CPU FIFO Write Pointer Position */
#define SERCOM_USART_EXT_FIFOPTR_CPUWRPTR_Msk (_UINT16_(0xF) << SERCOM_USART_EXT_FIFOPTR_CPUWRPTR_Pos) /* (SERCOM_USART_EXT_FIFOPTR) CPU FIFO Write Pointer Mask */
#define SERCOM_USART_EXT_FIFOPTR_CPUWRPTR(value) (SERCOM_USART_EXT_FIFOPTR_CPUWRPTR_Msk & (_UINT16_(value) << SERCOM_USART_EXT_FIFOPTR_CPUWRPTR_Pos)) /* Assigment of value for CPUWRPTR in the SERCOM_USART_EXT_FIFOPTR register */
#define SERCOM_USART_EXT_FIFOPTR_CPURDPTR_Pos _UINT16_(8)                                          /* (SERCOM_USART_EXT_FIFOPTR) CPU FIFO Read Pointer Position */
#define SERCOM_USART_EXT_FIFOPTR_CPURDPTR_Msk (_UINT16_(0xF) << SERCOM_USART_EXT_FIFOPTR_CPURDPTR_Pos) /* (SERCOM_USART_EXT_FIFOPTR) CPU FIFO Read Pointer Mask */
#define SERCOM_USART_EXT_FIFOPTR_CPURDPTR(value) (SERCOM_USART_EXT_FIFOPTR_CPURDPTR_Msk & (_UINT16_(value) << SERCOM_USART_EXT_FIFOPTR_CPURDPTR_Pos)) /* Assigment of value for CPURDPTR in the SERCOM_USART_EXT_FIFOPTR register */
#define SERCOM_USART_EXT_FIFOPTR_Msk          _UINT16_(0x0F0F)                                     /* (SERCOM_USART_EXT_FIFOPTR) Register Mask  */


/* -------- SERCOM_USART_INT_FIFOPTR : (SERCOM Offset: 0x36) (R/W 16) USART_INT FIFO CPU Pointers -------- */
#define SERCOM_USART_INT_FIFOPTR_RESETVALUE   _UINT16_(0x00)                                       /*  (SERCOM_USART_INT_FIFOPTR) USART_INT FIFO CPU Pointers  Reset Value */

#define SERCOM_USART_INT_FIFOPTR_CPUWRPTR_Pos _UINT16_(0)                                          /* (SERCOM_USART_INT_FIFOPTR) CPU FIFO Write Pointer Position */
#define SERCOM_USART_INT_FIFOPTR_CPUWRPTR_Msk (_UINT16_(0xF) << SERCOM_USART_INT_FIFOPTR_CPUWRPTR_Pos) /* (SERCOM_USART_INT_FIFOPTR) CPU FIFO Write Pointer Mask */
#define SERCOM_USART_INT_FIFOPTR_CPUWRPTR(value) (SERCOM_USART_INT_FIFOPTR_CPUWRPTR_Msk & (_UINT16_(value) << SERCOM_USART_INT_FIFOPTR_CPUWRPTR_Pos)) /* Assigment of value for CPUWRPTR in the SERCOM_USART_INT_FIFOPTR register */
#define SERCOM_USART_INT_FIFOPTR_CPURDPTR_Pos _UINT16_(8)                                          /* (SERCOM_USART_INT_FIFOPTR) CPU FIFO Read Pointer Position */
#define SERCOM_USART_INT_FIFOPTR_CPURDPTR_Msk (_UINT16_(0xF) << SERCOM_USART_INT_FIFOPTR_CPURDPTR_Pos) /* (SERCOM_USART_INT_FIFOPTR) CPU FIFO Read Pointer Mask */
#define SERCOM_USART_INT_FIFOPTR_CPURDPTR(value) (SERCOM_USART_INT_FIFOPTR_CPURDPTR_Msk & (_UINT16_(value) << SERCOM_USART_INT_FIFOPTR_CPURDPTR_Pos)) /* Assigment of value for CPURDPTR in the SERCOM_USART_INT_FIFOPTR register */
#define SERCOM_USART_INT_FIFOPTR_Msk          _UINT16_(0x0F0F)                                     /* (SERCOM_USART_INT_FIFOPTR) Register Mask  */


/** \brief SERCOM register offsets definitions */
#define SERCOM_I2CM_CTRLA_REG_OFST     _UINT32_(0x00)      /* (SERCOM_I2CM_CTRLA) I2CM Control A Offset */
#define SERCOM_I2CS_CTRLA_REG_OFST     _UINT32_(0x00)      /* (SERCOM_I2CS_CTRLA) I2CS Control A Offset */
#define SERCOM_SPIM_CTRLA_REG_OFST     _UINT32_(0x00)      /* (SERCOM_SPIM_CTRLA) SPIM Control A Offset */
#define SERCOM_SPIS_CTRLA_REG_OFST     _UINT32_(0x00)      /* (SERCOM_SPIS_CTRLA) SPIS Control A Offset */
#define SERCOM_USART_EXT_CTRLA_REG_OFST _UINT32_(0x00)      /* (SERCOM_USART_EXT_CTRLA) USART_EXT Control A Offset */
#define SERCOM_USART_INT_CTRLA_REG_OFST _UINT32_(0x00)      /* (SERCOM_USART_INT_CTRLA) USART_INT Control A Offset */
#define SERCOM_I2CM_CTRLB_REG_OFST     _UINT32_(0x04)      /* (SERCOM_I2CM_CTRLB) I2CM Control B Offset */
#define SERCOM_I2CS_CTRLB_REG_OFST     _UINT32_(0x04)      /* (SERCOM_I2CS_CTRLB) I2CS Control B Offset */
#define SERCOM_SPIM_CTRLB_REG_OFST     _UINT32_(0x04)      /* (SERCOM_SPIM_CTRLB) SPIM Control B Offset */
#define SERCOM_SPIS_CTRLB_REG_OFST     _UINT32_(0x04)      /* (SERCOM_SPIS_CTRLB) SPIS Control B Offset */
#define SERCOM_USART_EXT_CTRLB_REG_OFST _UINT32_(0x04)      /* (SERCOM_USART_EXT_CTRLB) USART_EXT Control B Offset */
#define SERCOM_USART_INT_CTRLB_REG_OFST _UINT32_(0x04)      /* (SERCOM_USART_INT_CTRLB) USART_INT Control B Offset */
#define SERCOM_I2CM_CTRLC_REG_OFST     _UINT32_(0x08)      /* (SERCOM_I2CM_CTRLC) I2CM Control C Offset */
#define SERCOM_I2CS_CTRLC_REG_OFST     _UINT32_(0x08)      /* (SERCOM_I2CS_CTRLC) I2CS Control C Offset */
#define SERCOM_SPIM_CTRLC_REG_OFST     _UINT32_(0x08)      /* (SERCOM_SPIM_CTRLC) SPIM Control C Offset */
#define SERCOM_SPIS_CTRLC_REG_OFST     _UINT32_(0x08)      /* (SERCOM_SPIS_CTRLC) SPIS Control C Offset */
#define SERCOM_USART_EXT_CTRLC_REG_OFST _UINT32_(0x08)      /* (SERCOM_USART_EXT_CTRLC) USART_EXT Control C Offset */
#define SERCOM_USART_INT_CTRLC_REG_OFST _UINT32_(0x08)      /* (SERCOM_USART_INT_CTRLC) USART_INT Control C Offset */
#define SERCOM_I2CM_BAUD_REG_OFST      _UINT32_(0x0C)      /* (SERCOM_I2CM_BAUD) I2CM Baud Rate Offset */
#define SERCOM_SPIM_BAUD_REG_OFST      _UINT32_(0x0C)      /* (SERCOM_SPIM_BAUD) SPIM Baud Rate Offset */
#define SERCOM_SPIS_BAUD_REG_OFST      _UINT32_(0x0C)      /* (SERCOM_SPIS_BAUD) SPIS Baud Rate Offset */
#define SERCOM_USART_EXT_BAUD_REG_OFST _UINT32_(0x0C)      /* (SERCOM_USART_EXT_BAUD) USART_EXT Baud Rate Offset */
#define SERCOM_USART_INT_BAUD_REG_OFST _UINT32_(0x0C)      /* (SERCOM_USART_INT_BAUD) USART_INT Baud Rate Offset */
#define SERCOM_USART_EXT_RXPL_REG_OFST _UINT32_(0x0E)      /* (SERCOM_USART_EXT_RXPL) USART_EXT Receive Pulse Length Offset */
#define SERCOM_USART_INT_RXPL_REG_OFST _UINT32_(0x0E)      /* (SERCOM_USART_INT_RXPL) USART_INT Receive Pulse Length Offset */
#define SERCOM_I2CM_INTENCLR_REG_OFST  _UINT32_(0x14)      /* (SERCOM_I2CM_INTENCLR) I2CM Interrupt Enable Clear Offset */
#define SERCOM_I2CS_INTENCLR_REG_OFST  _UINT32_(0x14)      /* (SERCOM_I2CS_INTENCLR) I2CS Interrupt Enable Clear Offset */
#define SERCOM_SPIM_INTENCLR_REG_OFST  _UINT32_(0x14)      /* (SERCOM_SPIM_INTENCLR) SPIM Interrupt Enable Clear Offset */
#define SERCOM_SPIS_INTENCLR_REG_OFST  _UINT32_(0x14)      /* (SERCOM_SPIS_INTENCLR) SPIS Interrupt Enable Clear Offset */
#define SERCOM_USART_EXT_INTENCLR_REG_OFST _UINT32_(0x14)      /* (SERCOM_USART_EXT_INTENCLR) USART_EXT Interrupt Enable Clear Offset */
#define SERCOM_USART_INT_INTENCLR_REG_OFST _UINT32_(0x14)      /* (SERCOM_USART_INT_INTENCLR) USART_INT Interrupt Enable Clear Offset */
#define SERCOM_I2CM_INTENSET_REG_OFST  _UINT32_(0x16)      /* (SERCOM_I2CM_INTENSET) I2CM Interrupt Enable Set Offset */
#define SERCOM_I2CS_INTENSET_REG_OFST  _UINT32_(0x16)      /* (SERCOM_I2CS_INTENSET) I2CS Interrupt Enable Set Offset */
#define SERCOM_SPIM_INTENSET_REG_OFST  _UINT32_(0x16)      /* (SERCOM_SPIM_INTENSET) SPIM Interrupt Enable Set Offset */
#define SERCOM_SPIS_INTENSET_REG_OFST  _UINT32_(0x16)      /* (SERCOM_SPIS_INTENSET) SPIS Interrupt Enable Set Offset */
#define SERCOM_USART_EXT_INTENSET_REG_OFST _UINT32_(0x16)      /* (SERCOM_USART_EXT_INTENSET) USART_EXT Interrupt Enable Set Offset */
#define SERCOM_USART_INT_INTENSET_REG_OFST _UINT32_(0x16)      /* (SERCOM_USART_INT_INTENSET) USART_INT Interrupt Enable Set Offset */
#define SERCOM_I2CM_INTFLAG_REG_OFST   _UINT32_(0x18)      /* (SERCOM_I2CM_INTFLAG) I2CM Interrupt Flag Status and Clear Offset */
#define SERCOM_I2CS_INTFLAG_REG_OFST   _UINT32_(0x18)      /* (SERCOM_I2CS_INTFLAG) I2CS Interrupt Flag Status and Clear Offset */
#define SERCOM_SPIM_INTFLAG_REG_OFST   _UINT32_(0x18)      /* (SERCOM_SPIM_INTFLAG) SPIM Interrupt Flag Status and Clear Offset */
#define SERCOM_SPIS_INTFLAG_REG_OFST   _UINT32_(0x18)      /* (SERCOM_SPIS_INTFLAG) SPIS Interrupt Flag Status and Clear Offset */
#define SERCOM_USART_EXT_INTFLAG_REG_OFST _UINT32_(0x18)      /* (SERCOM_USART_EXT_INTFLAG) USART_EXT Interrupt Flag Status and Clear Offset */
#define SERCOM_USART_INT_INTFLAG_REG_OFST _UINT32_(0x18)      /* (SERCOM_USART_INT_INTFLAG) USART_INT Interrupt Flag Status and Clear Offset */
#define SERCOM_I2CM_STATUS_REG_OFST    _UINT32_(0x1A)      /* (SERCOM_I2CM_STATUS) I2CM Status Offset */
#define SERCOM_I2CS_STATUS_REG_OFST    _UINT32_(0x1A)      /* (SERCOM_I2CS_STATUS) I2CS Status Offset */
#define SERCOM_SPIM_STATUS_REG_OFST    _UINT32_(0x1A)      /* (SERCOM_SPIM_STATUS) SPIM Status Offset */
#define SERCOM_SPIS_STATUS_REG_OFST    _UINT32_(0x1A)      /* (SERCOM_SPIS_STATUS) SPIS Status Offset */
#define SERCOM_USART_EXT_STATUS_REG_OFST _UINT32_(0x1A)      /* (SERCOM_USART_EXT_STATUS) USART_EXT Status Offset */
#define SERCOM_USART_INT_STATUS_REG_OFST _UINT32_(0x1A)      /* (SERCOM_USART_INT_STATUS) USART_INT Status Offset */
#define SERCOM_I2CM_SYNCBUSY_REG_OFST  _UINT32_(0x1C)      /* (SERCOM_I2CM_SYNCBUSY) I2CM Synchronization Busy Offset */
#define SERCOM_I2CS_SYNCBUSY_REG_OFST  _UINT32_(0x1C)      /* (SERCOM_I2CS_SYNCBUSY) I2CS Synchronization Busy Offset */
#define SERCOM_SPIM_SYNCBUSY_REG_OFST  _UINT32_(0x1C)      /* (SERCOM_SPIM_SYNCBUSY) SPIM Synchronization Busy Offset */
#define SERCOM_SPIS_SYNCBUSY_REG_OFST  _UINT32_(0x1C)      /* (SERCOM_SPIS_SYNCBUSY) SPIS Synchronization Busy Offset */
#define SERCOM_USART_EXT_SYNCBUSY_REG_OFST _UINT32_(0x1C)      /* (SERCOM_USART_EXT_SYNCBUSY) USART_EXT Synchronization Busy Offset */
#define SERCOM_USART_INT_SYNCBUSY_REG_OFST _UINT32_(0x1C)      /* (SERCOM_USART_INT_SYNCBUSY) USART_INT Synchronization Busy Offset */
#define SERCOM_USART_EXT_RXERRCNT_REG_OFST _UINT32_(0x20)      /* (SERCOM_USART_EXT_RXERRCNT) USART_EXT Receive Error Count Offset */
#define SERCOM_USART_INT_RXERRCNT_REG_OFST _UINT32_(0x20)      /* (SERCOM_USART_INT_RXERRCNT) USART_INT Receive Error Count Offset */
#define SERCOM_I2CS_LENGTH_REG_OFST    _UINT32_(0x22)      /* (SERCOM_I2CS_LENGTH) I2CS Length Offset */
#define SERCOM_SPIM_LENGTH_REG_OFST    _UINT32_(0x22)      /* (SERCOM_SPIM_LENGTH) SPIM Length Offset */
#define SERCOM_SPIS_LENGTH_REG_OFST    _UINT32_(0x22)      /* (SERCOM_SPIS_LENGTH) SPIS Length Offset */
#define SERCOM_USART_EXT_LENGTH_REG_OFST _UINT32_(0x22)      /* (SERCOM_USART_EXT_LENGTH) USART_EXT Length Offset */
#define SERCOM_USART_INT_LENGTH_REG_OFST _UINT32_(0x22)      /* (SERCOM_USART_INT_LENGTH) USART_INT Length Offset */
#define SERCOM_I2CM_ADDR_REG_OFST      _UINT32_(0x24)      /* (SERCOM_I2CM_ADDR) I2CM Address Offset */
#define SERCOM_I2CS_ADDR_REG_OFST      _UINT32_(0x24)      /* (SERCOM_I2CS_ADDR) I2CS Address Offset */
#define SERCOM_SPIM_ADDR_REG_OFST      _UINT32_(0x24)      /* (SERCOM_SPIM_ADDR) SPIM Address Offset */
#define SERCOM_SPIS_ADDR_REG_OFST      _UINT32_(0x24)      /* (SERCOM_SPIS_ADDR) SPIS Address Offset */
#define SERCOM_I2CM_DATA_REG_OFST      _UINT32_(0x28)      /* (SERCOM_I2CM_DATA) I2CM Data Offset */
#define SERCOM_I2CS_DATA_REG_OFST      _UINT32_(0x28)      /* (SERCOM_I2CS_DATA) I2CS Data Offset */
#define SERCOM_SPIM_DATA_REG_OFST      _UINT32_(0x28)      /* (SERCOM_SPIM_DATA) SPIM Data Offset */
#define SERCOM_SPIS_DATA_REG_OFST      _UINT32_(0x28)      /* (SERCOM_SPIS_DATA) SPIS Data Offset */
#define SERCOM_USART_EXT_DATA_REG_OFST _UINT32_(0x28)      /* (SERCOM_USART_EXT_DATA) USART_EXT Data Offset */
#define SERCOM_USART_INT_DATA_REG_OFST _UINT32_(0x28)      /* (SERCOM_USART_INT_DATA) USART_INT Data Offset */
#define SERCOM_I2CM_DBGCTRL_REG_OFST   _UINT32_(0x30)      /* (SERCOM_I2CM_DBGCTRL) I2CM Debug Control Offset */
#define SERCOM_SPIM_DBGCTRL_REG_OFST   _UINT32_(0x30)      /* (SERCOM_SPIM_DBGCTRL) SPIM Debug Control Offset */
#define SERCOM_SPIS_DBGCTRL_REG_OFST   _UINT32_(0x30)      /* (SERCOM_SPIS_DBGCTRL) SPIS Debug Control Offset */
#define SERCOM_USART_EXT_DBGCTRL_REG_OFST _UINT32_(0x30)      /* (SERCOM_USART_EXT_DBGCTRL) USART_EXT Debug Control Offset */
#define SERCOM_USART_INT_DBGCTRL_REG_OFST _UINT32_(0x30)      /* (SERCOM_USART_INT_DBGCTRL) USART_INT Debug Control Offset */
#define SERCOM_I2CM_FIFOSPACE_REG_OFST _UINT32_(0x34)      /* (SERCOM_I2CM_FIFOSPACE) I2CM FIFO Space Offset */
#define SERCOM_I2CS_FIFOSPACE_REG_OFST _UINT32_(0x34)      /* (SERCOM_I2CS_FIFOSPACE) I2CS FIFO Space Offset */
#define SERCOM_SPIM_FIFOSPACE_REG_OFST _UINT32_(0x34)      /* (SERCOM_SPIM_FIFOSPACE) SPIM FIFO Space Offset */
#define SERCOM_SPIS_FIFOSPACE_REG_OFST _UINT32_(0x34)      /* (SERCOM_SPIS_FIFOSPACE) SPIS FIFO Space Offset */
#define SERCOM_USART_EXT_FIFOSPACE_REG_OFST _UINT32_(0x34)      /* (SERCOM_USART_EXT_FIFOSPACE) USART_EXT FIFO Space Offset */
#define SERCOM_USART_INT_FIFOSPACE_REG_OFST _UINT32_(0x34)      /* (SERCOM_USART_INT_FIFOSPACE) USART_INT FIFO Space Offset */
#define SERCOM_I2CM_FIFOPTR_REG_OFST   _UINT32_(0x36)      /* (SERCOM_I2CM_FIFOPTR) I2CM FIFO CPU Pointers Offset */
#define SERCOM_I2CS_FIFOPTR_REG_OFST   _UINT32_(0x36)      /* (SERCOM_I2CS_FIFOPTR) I2CS FIFO CPU Pointers Offset */
#define SERCOM_SPIM_FIFOPTR_REG_OFST   _UINT32_(0x36)      /* (SERCOM_SPIM_FIFOPTR) SPIM FIFO CPU Pointers Offset */
#define SERCOM_SPIS_FIFOPTR_REG_OFST   _UINT32_(0x36)      /* (SERCOM_SPIS_FIFOPTR) SPIS FIFO CPU Pointers Offset */
#define SERCOM_USART_EXT_FIFOPTR_REG_OFST _UINT32_(0x36)      /* (SERCOM_USART_EXT_FIFOPTR) USART_EXT FIFO CPU Pointers Offset */
#define SERCOM_USART_INT_FIFOPTR_REG_OFST _UINT32_(0x36)      /* (SERCOM_USART_INT_FIFOPTR) USART_INT FIFO CPU Pointers Offset */

